# Завдання: модіфікувати попередне завдання використавши
#          lambda функції.
#
# Приклад:
#         ввод: 32 7 0 10 11 78 9 5 23 99
#         результат: 32 0 10 78
#
# Підказка:
#   * evens = lambda n: n % 2 == 0 (чи можно одразу передати
#                lambda n: n % 2 == 0 у місці виклиу функції
#                другим аргументом - вона одразу присвоїться
#                в аргумент, але не буде доступна після).


a = [32, 7, 0, 10, 11, 78, 9, 5, 23, 99]


def func_1(array):
	func_2 = lambda x: x % 2 == 0
	b = [i for i in array if func_2(i)]
	return b


print(func_1(a))
