# Є словник з ключами-строками та елементами-списками строк, наприклад:
#
# data = {
#  	'colors': ['red', 'green', 'blue', 'purple'],
#  	'fruits': ['pineapple', 'orange', 'banana'],
#  	'clothes': ['coat', 'tshirt']
# }
#
# Завдання: перебудувати словник (не створюючи новий) таким чином що
#           його значення стануть ключами значенням котрих буде їхній
#           ключ з початкового словника.
#
# Підказки:
# * dict[key] = value
# * for key in dict
# * for value in dict[key]


# * для ітерації по ключам вхідного словника (його ключам) у констукції циклу використайте list(data.keys()) - це зробить копію ключів початкового словника
# та помістить їх у списко (можно взяти також кортеж) - це створює копію ключів для використання в ітераціях циклу,
# тому що оригінальний словник буде модіфікуватись у кожній ітерації;
# * кожна ітерація буде починатись з видалення ключа - dict.pop(key) - яка видаляє ключ key зі словника та повертає його значення (які потрібно зберегти)
# * потім потрібно проітерувати по значенням один за одним (це вкладений цикл for) и зберегти у словнику нові ключі з відповідним значенням.


data = {
    'colors': ['red', 'green', 'blue', 'purple'],
    'fruits': ['pineapple', 'orange', 'banana'],
    'clothes': ['coat', 'tshirt']
}

for key in list(data):
    a = data.pop(key)
    for value in a:
        data[value] = key
